Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    GSignalFlow_SendText(buffer);
    return 1U;
}

static void GSignalFlow_QueueHmiMeasurement(void)
{
    /* 三个主要参数先立即显示，确保后续波形采集不会拖住Urms。 */
    GSignalFlow_UpdateHmiMeasurementField(0U);
    GSignalFlow_UpdateHmiMeasurementField(1U);
    GSignalFlow_UpdateHmiMeasurementField(2U);
    s_HmiMeasurementField = 3U;
    s_HmiMeasurementPending = 1U;
}

/* 每次主循环最多更新一个文本控件，避免参数集中成批发送。 */
static void GSignalFlow_ServiceHmiMeasurement(void)
{
    if (s_HmiMeasurementPending != 0U)
    {
        GSignalFlow_UpdateHmiMeasurementField(s_HmiMeasurementField);
        s_HmiMeasurementField++;

        if (s_HmiMeasurementField >= G_FLOW_HMI_MEASUREMENT_FIELDS)
        {
            s_HmiMeasurementPending = 0U;
        }
        return;
    }

    if ((s_HmiReadyPending != 0U) &&
        (s_State == G_FLOW_STATE_HOLD) &&
        ((int32_t)(HAL_GetTick() - s_HmiBusyUntilTick) >= 0))
    {
        TjcHmi_SetComputeBusy(0U);
        s_HmiReadyPending = 0U;
    }
}

static void GSignalFlow_UpdateHmiMeasurementField(uint8_t field)
{
    char text[64];
    char value_text[24];
    const char *object_name;

    if (field == 0U)
    {
        (void)snprintf(text,
                       sizeof(text),
                       "F=%luHZ",
                       (unsigned long)GSignalFlow_RoundPositive(
                           s_Measurement.fundamental_hz));
        tjc_send_txt("t0", "txt", text);
        return;
    }
    if (field == 1U)
    {
        GSignalFlow_FormatFixed2(s_Measurement.upp_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       "Vpp=%s mV",
                       value_text);
        tjc_send_txt("t1", "txt", text);
        return;
    }
    if (field == 2U)
    {
        GSignalFlow_FormatFixed2(s_Measurement.urms_mv,
                                 value_text,
                                 sizeof(value_text));
        (void)snprintf(text,
                       sizeof(text),
                       "Vrms=%s mV",
                       value_text);
        tjc_send_txt("t2", "txt", text);
        return;
    }

    if (field <= 5U)
    {
        uint8_t slot = (uint8_t)(field - 3U);
        const GMeasurementComponent *item = NULL;

        object_name = (field == 3U) ? "t3" :
                      ((field == 4U) ? "t4" : "t5");

        if (slot < s_Measurement.component_count)
        {
            item = &s_Measurement.components[slot];
        }

        if (item != NULL)
        {
            GSignalFlow_FormatFixed2(item->amplitude_mv,
                                     value_text,
                                     sizeof(value_text));
            (void)snprintf(text,
                           sizeof(text),
                           "H%u=%luHZ,%smV",
                           (unsigned int)item->harmonic,
                           (unsigned long)GSignalFlow_RoundPositive(
                               item->frequency_hz),
                           value_text);
        }
        else
        {
            (void)snprintf(text,
                           sizeof(text),
                           "H=XXXHZ,XXX.XXmV");
        }
        tjc_send_txt(object_name, "txt", text);
        return;
    }
}

static void GSignalFlow_UpdateHmiPlaceholders(void)
{
    uint8_t field;

    tjc_send_txt("t0", "txt", "F=XXXHZ");
    tjc_send_txt("t1", "txt", "Vpp=XXX mV");
    tjc_send_txt("t2", "txt", "Vrms=XXX mV");
    for (field = 3U; field <= 5U; field++)
    {
        char object_name[3] = {'t', (char)('0' + field), '\0'};
        char text[28];

        (void)snprintf(text,
                       sizeof(text),
                       "H=XXXHZ,XXX.XXmV");
        tjc_send_txt(object_name, "txt", text);
    }
}

static void GSignalFlow_UpdateHmiNoSignal(void)
{
    s_HmiMeasurementPending = 0U;
    GSignalFlow_UpdateHmiPlaceholders();
    (void)GSignalFlow_UpdateHmiSpectrum(0U);
}

static uint8_t GSignalFlow_UpdateHmiSpectrum(uint8_t signal_valid)
{
    uint16_t display_points = s_SpectrumDisplayPoints;
    uint8_t width_ready = 1U;

    if (display_points == 0U)
    {
        if (TjcHmi_GetComponentWidth("s1", &display_points) != 0U)
        {
            s_SpectrumDisplayPoints = display_points;
        }
        else
        {
            display_points = G_FLOW_SPECTRUM_FALLBACK_POINTS;
            width_ready = 0U;
        }
    }

    if (display_points > G_FLOW_SPECTRUM_MAX_POINTS)
    {
        display_points = G_FLOW_SPECTRUM_MAX_POINTS;
    }

    if ((signal_valid == 0U) ||
        (GSignalFlow_BuildQualitativeSpectrum(display_points) == 0U))
    {
        memset(s_SpectrumDisplay,
               G_FLOW_SPECTRUM_VERTICAL_OFFSET,
               display_points);
    }

    /*
     * ref s1先重绘波形控件背景，清除旧版本用xstr画出的谐波文字；
     * 新版本不再在频谱区域绘制任何文字标注。
     */
    tjc_send_string("ref s1");
    tjc_clear_wave("s1.id", 0);
    tjc_send_wave("s1.id",
                  0,
                  s_SpectrumDisplay,
                  display_points);
    if (width_ready != 0U)
    {
        s_SpectrumScreenInitialized = 1U;
        return 1U;
    }

    s_SpectrumScreenInitialized = 0U;
    return 0U;
}

static uint8_t GSignalFlow_BuildQualitativeSpectrum(uint16_t point_count)
{
    float maximum_amplitude = 0.0f;
    uint16_t half_width;
    uint8_t component;

    if ((point_count < 2U) || (s_Result.valid == 0U))
    {
        return 0U;
    }

    memset(s_SpectrumDisplay,
           G_FLOW_SPECTRUM_VERTICAL_OFFSET,
           point_count);

    for (component = 0U;
         component < s_Result.component_count;
         component++)
    {
        const SpectrumComponent *peak = &s_Result.components[component];

        if ((peak->frequency_hz >= (float)G_FLOW_SPECTRUM_MIN_HZ) &&
            (peak->frequency_hz <= (float)G_FLOW_SPECTRUM_MAX_HZ) &&
            (peak->amplitude_codes > maximum_amplitude))
        {
            maximum_amplitude = peak->amplitude_codes;
        }
    }

    if (maximum_amplitude <= 0.0f)
    {
        return 0U;
    }

    half_width = (uint16_t)(point_count / 256U);
    if (half_width < 2U)
    {
        half_width = 2U;
    }
    else if (half_width > 4U)
    {
        half_width = 4U;
    }

