Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    /*
     * 绘制检测到的最多三个实际分量，谐波次数不限于H1~H3。
     * 横坐标按10~500kHz线性映射；淘晶驰
     * addt数据在当前s1控件上的显示方向与数组索引相反，因此这里
     * 反向写入数组，保证屏幕实际从左到右按频率由低到高排列。
     * 峰高按各谐波幅值相对最强分量线性缩放，因此顺序、间隔和
     * 高度关系都保持定性比例，同时不会混入FFT底噪和非谐波毛刺。
     */
    for (component = 0U;
         component < s_Result.component_count;
         component++)
    {
        const SpectrumComponent *peak = &s_Result.components[component];

        if ((peak->frequency_hz >= (float)G_FLOW_SPECTRUM_MIN_HZ) &&
            (peak->frequency_hz <= (float)G_FLOW_SPECTRUM_MAX_HZ))
        {
            uint32_t frequency_hz =
                GSignalFlow_RoundPositive(peak->frequency_hz);
            uint16_t center = (uint16_t)(
                ((G_FLOW_SPECTRUM_MAX_HZ - frequency_hz) *
                 (uint32_t)(point_count - 1U) +
                 (G_FLOW_SPECTRUM_MAX_HZ -
                  G_FLOW_SPECTRUM_MIN_HZ) / 2UL) /
                (G_FLOW_SPECTRUM_MAX_HZ -
                 G_FLOW_SPECTRUM_MIN_HZ));
            uint32_t height = GSignalFlow_RoundPositive(
                (peak->amplitude_codes / maximum_amplitude) *
                (float)(G_FLOW_SPECTRUM_PEAK_VALUE -
                        G_FLOW_SPECTRUM_VERTICAL_OFFSET));
            int32_t offset;

            if (height < G_FLOW_SPECTRUM_MIN_PEAK_HEIGHT)
            {
                height = G_FLOW_SPECTRUM_MIN_PEAK_HEIGHT;
            }
            if (height > (G_FLOW_SPECTRUM_PEAK_VALUE -
                          G_FLOW_SPECTRUM_VERTICAL_OFFSET))
            {
                height = G_FLOW_SPECTRUM_PEAK_VALUE -
                         G_FLOW_SPECTRUM_VERTICAL_OFFSET;
            }

            for (offset = -(int32_t)half_width;
                 offset <= (int32_t)half_width;
                 offset++)
            {
                int32_t index = (int32_t)center + offset;

                if ((index >= 0) && (index < (int32_t)point_count))
                {
                    uint32_t distance = (offset < 0)
                        ? (uint32_t)(-offset) : (uint32_t)offset;
                    uint32_t local_height =
                        (height *
                         ((uint32_t)half_width + 1UL - distance) +
                         (uint32_t)half_width / 2UL) /
                        ((uint32_t)half_width + 1UL);
                    uint32_t value =
                        G_FLOW_SPECTRUM_VERTICAL_OFFSET + local_height;

                    if (value > s_SpectrumDisplay[index])
                    {
                        s_SpectrumDisplay[index] = (uint8_t)value;
                    }
                }
            }
        }
    }

    return 1U;
}

static uint8_t GSignalFlow_BuildAndDisplayWaveform(uint8_t cycles)
{
    if (GMeasurement_BuildWaveform(
            s_CaptureFrame,
            SPECTRUM_FRAME_LENGTH,
            G_MEASUREMENT_WAVEFORM_SAMPLE_RATE_HZ,
            s_Result.fundamental_hz,
            cycles,
            &s_Waveform) == 0U)
    {
        return 0U;
    }

    GSignalFlow_UpdateHmiWaveform();
    return 1U;
}

static void GSignalFlow_UpdateHmiWaveform(void)
{
    int32_t minimum;
    int32_t range;
    uint16_t point;
    uint16_t display_points = s_WaveDisplayPoints;

    if ((s_Waveform.valid == 0U) ||
        (s_Waveform.point_count != G_MEASUREMENT_WAVEFORM_POINTS))
    {
        return;
    }

    minimum = (int32_t)s_Waveform.minimum_code;
    range = (int32_t)s_Waveform.maximum_code - minimum;

    if (display_points == 0U)
    {
        if (TjcHmi_GetComponentWidth("s0", &display_points) != 0U)
        {
            s_WaveDisplayPoints = display_points;
        }
        else
        {
            display_points = G_FLOW_WAVE_FALLBACK_POINTS;
        }
    }
    if (display_points > G_FLOW_WAVE_MAX_POINTS)
    {
        display_points = G_FLOW_WAVE_MAX_POINTS;
    }

    for (point = 0U; point < display_points; point++)
    {
        uint32_t source_numerator =
            (uint32_t)point *
            (uint32_t)(s_Waveform.point_count - 1U);
        uint16_t source_index = (uint16_t)(
            source_numerator / (display_points - 1U));
        uint32_t source_remainder =
            source_numerator % (display_points - 1U);
        uint16_t next_index =
            (source_index + 1U < s_Waveform.point_count)
            ? (uint16_t)(source_index + 1U)
            : source_index;
        int32_t interpolated =
            ((int32_t)s_Waveform.points[source_index] *
             (int32_t)((display_points - 1U) -
                       source_remainder) +
             (int32_t)s_Waveform.points[next_index] *
             (int32_t)source_remainder) /
            (int32_t)(display_points - 1U);

        if (range <= 0)
        {
            s_WaveDisplay[point] = G_FLOW_WAVE_VERTICAL_OFFSET;
        }
        else
        {
            int32_t centered = interpolated - minimum;
            int32_t original_height = (centered * 254) / range;
            int32_t scaled = original_height /
                             (int32_t)G_FLOW_WAVE_HEIGHT_DIVISOR +
                             (int32_t)G_FLOW_WAVE_VERTICAL_OFFSET;

            if (scaled < 0)
            {
                scaled = 0;
            }
            if (scaled > 254)
            {
                scaled = 254;
            }
            s_WaveDisplay[point] = (uint8_t)scaled;
        }
    }

    tjc_clear_wave("s0.id", 0);
    tjc_send_wave("s0.id",
                  0,
                  s_WaveDisplay,
                  display_points);
}

static uint32_t GSignalFlow_RoundPositive(float value)
{
    if (value <= 0.0f)
    {
        return 0UL;
    }

    if (value >= 4294967040.0f)
    {
        return 0xFFFFFFFFUL;
    }

    return (uint32_t)(value + 0.5f);
}

static void GSignalFlow_FormatFixed2(float value,
                                     char *buffer,
                                     size_t buffer_size)
{
    uint32_t scaled;

    if ((buffer == NULL) || (buffer_size == 0U))
    {
        return;
    }

    scaled = GSignalFlow_RoundPositive(value * 100.0f);
    (void)snprintf(buffer,
                   buffer_size,
                   "%lu.%02lu",
                   (unsigned long)(scaled / 100UL),
                   (unsigned long)(scaled % 100UL));
}

const GMeasurementResult *GSignalFlow_GetLatestMeasurement(void)
{
    return &s_Measurement;
}

uint8_t GSignalFlow_SetWaveformCycles(uint8_t cycles)
{
    if ((cycles != 1U) && (cycles != 3U))
    {
        return 0U;
    }

    s_SelectedWaveformCycles = cycles;
    return 1U;
}

const GMeasurementWaveform *GSignalFlow_GetLatestWaveform(void)
{
    return &s_Waveform;
}
